test_mix/oneParticlesSediment_Re41_cfdemSolverMix/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;
    root            "";
    case            "";
    instance        "";
    local           "";
    class           dictionary;
    object          couplingProperties;
}

usedForSolverPiso false;

usedForSolverIB false;

useDynamicRefineMesh true;

refineMeshKeepInterval 300;

modelType none;

couplingInterval 5;

depth 0;

voidFractionModel mix;

locateModel engineIB;

meshMotionModel noMeshMotion;

dataExchangeModel mixTwoWayMPI;

IOModel basicIO;

probeModel off;

averagingModel mixDense;

clockModel off;

smoothingModel off;

forceModels
(
    // ArchimedesIB
    // ShirgaonkarIB
    mixArchimedesIB
    mixShirgaonkarIB
);

momCoupleModels
(
    mixImplicitCouple
);

mixImplicitCoupleProps
{
    velFieldName "U";
    granVelFieldName "Us";
    voidfractionFieldName "voidfraction";
}

// turbulenceModelType RASProperties;  // LESProperties or OFversion24x
turbulenceModelType turbulenceProperties; // OFversion30x

ArchimedesIBProps
{
    gravityFieldName "g";
    voidfractionFieldName "voidfractionNext";
}

ShirgaonkarIBProps
{
    velFieldName "U";
    pressureFieldName "p";
}

mixArchimedesIBProps
{
    gravityFieldName "g";
    voidfractionFieldName "voidfractionNext";
    volumefractionFieldName "volumefractionNext";
}

mixShirgaonkarIBProps
{
    velFieldName "U";
    pressureFieldName "p";
    volumefractionFieldName "volumefractionNext";
    lmpfFieldName "lmpf";
}

twoWayFilesProps
{
    maxNumberOfParticles 10000;
    DEMts 0.00003;
}

"(mixTwoWayMPIProps|twoWayMPIProps)"
{
    maxNumberOfParticles 10100;
    liggghtsPath "../DEM/in.liggghts_run";
}

IBProps
{
    maxCellsPerParticle 1000;
    alphaMin 0.30;
    scaleUpVol 1.0;
}

mixProps
{
    maxCellsPerParticle 100000;
    maxCellsNumPerCoarseParticle 100000;
    alphaMin 0.3;
    scaleUpVol 1.0;
}

bigParticleProps
{
    maxCellsPerParticle 1000;
    alphaMin 0.30;
    scaleUpVol 1.0;
}

centreProps
{
    alphaMin 0.30;
}

dividedProps
{
    alphaMin 0.05;
    scaleUpVol 1.2;
}

engineIBProps
{
    treeSearch false;
    zSplit 8;
    xySplit 16;
}
